package com.example.offlinequizzes;

import android.content.Intent;
import android.database.Cursor;
import android.os.CountDownTimer;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.Log;
import android.view.View;
import android.widget.Button;
import android.widget.ProgressBar;
import android.widget.RadioButton;
import android.widget.RadioGroup;
import android.widget.TextView;
import android.widget.Toast;

import java.util.ArrayList;
import java.util.Arrays;

public class ViewExam extends AppCompatActivity {

    private RadioGroup radioGroup;
    private RadioButton radioButton, radioButton1, radioButton2, radioButton3, radioButton4;
    private ProgressBar progressBar;
    private Button nextQuestion, previousQuestion;
    private TextView questionNumber, generalQuestion, Timer;
    private int cureentQuestion;
    private ArrayList<Exam> exam = new ArrayList<Exam>(10);
    private String[] studentAnswer = {"0", "0", "0", "0", "0", "0", "0", "0", "0", "0"};
    private String[] allCorrectAnswer = {"0", "0", "0", "0", "0", "0", "0", "0", "0", "0"};
    private String[] Questions = {"0", "0", "0", "0", "0", "0", "0", "0", "0", "0"};
    private String[] score = {"N", "N", "N", "N", "N", "N", "N", "N", "N", "N"};
    private CountDownTimer countDownTimer;
    private long time = 300000;
    private boolean timeRunning;
    private DatabaseHandler db;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_view_exam);

        db = new DatabaseHandler(this);
        radioGroup = (RadioGroup) findViewById(R.id.radiogroup);
        progressBar = (ProgressBar) findViewById(R.id.progressBar);
        radioButton1 = (RadioButton) findViewById(R.id.radioButton1);
        radioButton2 = (RadioButton) findViewById(R.id.radioButton2);
        radioButton3 = (RadioButton) findViewById(R.id.radioButton3);
        radioButton4 = (RadioButton) findViewById(R.id.radioButton4);
        questionNumber = (TextView) findViewById(R.id.question_number);
        generalQuestion = (TextView) findViewById(R.id.question);
        Timer = (TextView) findViewById(R.id.timer);
        nextQuestion = (Button) findViewById(R.id.nextQuestion);
        previousQuestion = (Button) findViewById(R.id.previous);
        cureentQuestion = 0;
        previousQuestion.setVisibility(View.GONE);

        deleteAllData();
        setData();
        generateExam(getExamType(), getExamPart() + "");
        Log.d("size_of_exam", exam.size() + "");
        if (exam.size() == 10) {
            startStop();
            showNextQuestion();
        } else {
            Toast.makeText(getApplicationContext(), "No Questions to Display", Toast.LENGTH_SHORT).show();
            backToHome();
        }


        nextQuestion.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                nextQuestionProcess();
            }
        });

        previousQuestion.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                previousQuestionProcess();
            }
        });

    }

    private void backToHome() {
        Intent intent = new Intent(this, Home.class);
        startActivity(intent);
    }

    //Done
    private void startStop() {
        if (timeRunning) {
            stopTime();
        } else {
            startTime();
        }
    }

    //Done
    private void stopTime() {
        countDownTimer.cancel();
        timeRunning = false;
    }

    //Done
    private void startTime() {
        countDownTimer = new CountDownTimer(time, 1000) {
            @Override
            public void onTick(long millisUntilFinished) {
                updateTimer(millisUntilFinished);
            }

            @Override
            public void onFinish() {
                showFinalResault();
            }
        }.start();
        timeRunning = true;
    }

    //Done
    private void updateTimer(long millisUntilFinished) {

        int seconds = (int) (millisUntilFinished / 1000);

        int hours = seconds / (60 * 60);
        int tempMint = (seconds - (hours * 60 * 60));
        int minutes = tempMint / 60;
        seconds = tempMint - (minutes * 60);


        Timer.setText("الوقت المتبقي : " +
                String.format("%d", minutes)
                + ":" + String.format("%02d", seconds));
    }

    //Done
    private void showFinalResault() {
        Intent intent = new Intent(this, ViewResult.class);
        intent.putExtra("FinalResault", score);
        intent.putExtra("studentAnswer", studentAnswer);
        intent.putExtra("allCorrectAnswer", allCorrectAnswer);
        intent.putExtra("Questions", Questions);
        startActivity(intent);
    }

    //Done
    private void previousQuestionProcess() {

        if (cureentQuestion >= 0) {
            checkAnswer();
            showPreviousQuestion();
        }
        toggleButton();

    }

    //Done
    private void nextQuestionProcess() {

        changeTextOfNextButton();
        if (cureentQuestion < 10) {
            checkAnswer();
            showNextQuestion();
        } else {
            checkAnswer();
            showFinalResault();
        }
        toggleButton();
    }

    //Done
    private void checkAnswer() {

        if (selectedAnswer().equals(correctAnswer())) {
            score[cureentQuestion - 1] = "1";
            studentAnswer[cureentQuestion - 1] = selectedAnswer();
        } else {
            studentAnswer[cureentQuestion - 1] = selectedAnswer();
            score[cureentQuestion - 1] = "N";
        }

        allCorrectAnswer[cureentQuestion - 1] = correctAnswer();
    }

    //Done
    private void changeTextOfNextButton() {

        if (cureentQuestion >= 9)
            nextQuestion.setText("عرض النتيجة النهائية");
        else
            nextQuestion.setText("السؤال التالي");

    }

    //Done
    private void toggleButton() {

        if (cureentQuestion > 1)
            previousQuestion.setVisibility(View.VISIBLE);
        else
            previousQuestion.setVisibility(View.GONE);
    }

    //Done
    private void getPreviousQuestion() {
        if (cureentQuestion > 0)
            cureentQuestion--;
    }

    //Done
    private void getNextQuestion() {
        if (cureentQuestion <= 10)
            cureentQuestion++;
    }

    //Done
    private void showNextQuestion() {
        getNextQuestion();
        changeProgressBar();
        questionNumber.setText("رقم السؤال: " + cureentQuestion + ".");
        generalQuestion.setText(exam.get(cureentQuestion - 1).getQuestion());
        ArrayList<String> ANSWER = exam.get(cureentQuestion - 1).getAnswers();
        radioButton1.setText(ANSWER.get(0));
        radioButton2.setText(ANSWER.get(1));
        radioButton3.setText(ANSWER.get(2));
        radioButton4.setText(ANSWER.get(3));
    }

    //Done
    private void showPreviousQuestion() {
        getPreviousQuestion();
        changeProgressBar();
        questionNumber.setText("رقم السؤال: " + cureentQuestion + ".");
        generalQuestion.setText(exam.get(cureentQuestion - 1).getQuestion());
        ArrayList<String> ANSWER = exam.get(cureentQuestion - 1).getAnswers();
        radioButton1.setText(ANSWER.get(0));
        radioButton2.setText(ANSWER.get(1));
        radioButton3.setText(ANSWER.get(2));
        radioButton4.setText(ANSWER.get(3));
    }

    //Done
    private String correctAnswer() {

        return exam.get(cureentQuestion - 1).getCorrect_answer();
    }

    //Done
    private String selectedAnswer() {
        int radioButtonId = radioGroup.getCheckedRadioButtonId();
        radioButton = (RadioButton) findViewById(radioButtonId);
        return radioButton.getText().toString();
    }

    //Done
    private void changeProgressBar() {

        progressBar.setProgress(cureentQuestion * 10);
    }

    //Done
    private String getExamType() {

        return getIntent().getExtras().getString("examType");
    }

    //Done
    private int getExamPart() {

        return getIntent().getExtras().getInt("examPart");
    }

    //Done
    private void generateExam(String examType, String examNumber) {
        switch (examType) {
            case "Religion":
                exam = getData("Religion", examNumber);
                exam = getRandomQuestions();
                break;

            case "Arabic":
                exam = getData("Arabic", examNumber);
                exam = getRandomQuestions();
                break;

            case "History":
                exam = getData("History", examNumber);
                exam = getRandomQuestions();
                break;

            case "Geography":
                exam = getData("Geography", examNumber);
                exam = getRandomQuestions();
                break;

            case "Biology":
                exam = getData("Biology", examNumber);
                exam = getRandomQuestions();
                break;

            case "Chemistry":
                exam = getData("Chemistry", examNumber);
                exam = getRandomQuestions();
                break;
        }
    }


    private void setReligionExam() {
        db.insertData("Religion", "1", "ما معنى التوكل على الله ؟ ", "الرضا بقضاء الله مع الأخذ بالأسباب", "الرضا بقضاء الله مع الأخذ بالأسباب", "ترك الأخذ بالأسباب ", "الرضا بقضاء الله دون الأخذ بالأسباب", "أن يسعى العبد للتغلب على الصعاب مع الأخذ بالأسباب ");
        db.insertData("Religion", "1", "بماذا لقبت السيدة عائشة رضي الله عنها ؟", "الصدّيقة", "الصابرة", "الصدّيقة", "المخلصة", "المُنققة");
        db.insertData("Religion", "1", "من الذي قال للرسول عليه الصلاة والسلام تباً لك ألهذا جمعتنا ؟ ", "أبو لهب", "أبو جهل ", "أبو العاص", "أبو لهب", "أبو الأرقم ");
        db.insertData("Religion", "1", " ما تعريف الإيمان ؟ ", "تصديق بالجنان وإقرار باللسان وعمل بالجوارح", "عمل بالجوارح وتصديق بالقلب", "عمل بالجوارح ولإقرار باللسان", "تصديق بالجنان وإقرار باللسان وعمل بالجوارح", "تصديق جازم بالقلب");
        db.insertData("Religion", "1", "ما حكم يمين اللغو ؟ ", "لا كفارة عليه", "عليه كفارة", "لا كفارة عليه", "يغمس صاحبه بالنار ولا كفارة عليه", "واجب الوفاء به وفيه كفارة");
        db.insertData("Religion", "1", "ما المقصود بقطعي الدلالة ؟ ", "ما يفيد معنى واحداً قطعيا", "ما يحتمل أكثر من معنى", "ما كان ثبوته ثبوتاً قطعياً", "ما يفيد معنى واحداً قطعياُ", "ما لا يفسره إلا الراسخون بالعلم");
        db.insertData("Religion", "1", "من أول من أدخل الأصنام إلى جزيرة العرب ؟ ", "عمرو بن لُحي", "عمرو بن لُحي", "عقبة بن أبي معيط", "عتبة بن أبي لهب", "أُبي بن خلف");
        db.insertData("Religion", "1", "ما المصطلح الذي يعني (الزيادة في أحد البدلين عن الأخر عند اتحاد الجنس ؟ ", "ربا الفضل ", "ربا الديون", "ربا النسيئة", "ربا الفضل ", "ربا العينة");
        db.insertData("Religion", "1", "من مؤلف كتاب (قواعد الأحكام في مصالح الأنام) ؟ ", "العز بن عبد السلام", "ابن تيمية", "ابن قيم الجوزية", "العز بن عبد السلام", "السيوطي ");
        db.insertData("Religion", "1", "متى كان تحرير القدس من الصليبيين ؟ ", "27 من رجب سنة 583 هجري", "27 من رمضان سنة 583 هجري ", "27 من رجب سنة 583 هجري", "25 من شعبان سنة 583 هجري", "25 من شوال سنة 583 هجري ");
        db.insertData("Religion", "2", "ماذا نسمي الكتب التي رتبت حسب أسماء الصحابة ؟ ", "مسانيد", "مصنفات", "سنن", "مسانيد", "جوامع");
        db.insertData("Religion", "2", "ما الأثر الذي ينشأ عن استشعار المؤمن لرقابة الله تعالى في السر والعلن  ؟ ", "استقامة السلوك و الأخلاق", "استقامة السلوك و الأخلاق ", "النصر والتمكين", "الصبر والرضا", "العزة والشجاعة");
        db.insertData("Religion", "2", "ما مقدار المد المنفصل ؟ ", "(5-2-4) حركات", "حركتان ", " (5-4) حركات", "(5-2-4) حركات", "(2-4-6) حركات");
        db.insertData("Religion", "2", "ماذا يسمى إيقاف الإنجاب بشكل أبدي ؟ ", "تحديد النسل", "تحديد النسل", "الإجهاض", "تنظيم النسل", "الإخصاب الصناعي");
        db.insertData("Religion", "2", "ما معنى كلمة (محيص) ؟ ", "منجى", "حصى", "هلاك", "حجة وبرهان", "منجى");
        db.insertData("Religion", "2", "ما الذي يعد مثالاً على التحسينيات ؟ ", "أداب الطعام والشراب", "أداب الطعام والشراب", "الصلوات الخمس", "التيمم عند وجود الماء", "حفظ النسل والمال");
        db.insertData("Religion", "2", "بم تميز عهد الخلافة الراشدة في اهتمامه بالسنة ؟ ", "حفظ الأحاديث دون كتابتها", "حفظ الأحاديث وكتابتها", "حفظ الأحاديث دون كتابتها", "تدوين الأحاديث الصحيحة", "نسخ الأحاديث وتوزيعها");
        db.insertData("Religion", "2", "لمن وجه الخطاب في قوله تعالى (وكيف تكفرون وأنتم تتلى عليكم أيات الله وفيكم رسوله ) ؟ ", "الصحابة", "التابعيين", "اليهود", "قريش", "الصحابة");
        db.insertData("Religion", "2", "ما حكم تلقيح بويضة الزوجة من زوجها بتدخل طبي موثوق وزرعها في رحم الزوجة ؟ ", "مباح للضرورة", "جائز بشروط", "جائز إن كان بإذن الزوجة", "مباح للضرورة", "حرام إلا برضى الزوج");
        db.insertData("Religion", "2", "ما نوع المد في كلمة إيلآفهم ؟ ", "بدل", "منفصل", "لين", "بدل", "متصل");
        db.insertData("Religion", "3", "ما حكم لفظ الجلالة في قوله قوماً الله ؟ ", "الترقيق", "الترقيق", "التفخيم", "جواز الوجهين", "الإدغام بغير غنة");
        db.insertData("Religion", "3", "علام استند المحرّمون للتأمين التجاري ؟ ", "فيه مقامرة وأكل مال بالباطل ", "فيه مقامرة وأكل مال بالباطل ", "فيه تعاون وتكافل", "فيه تبرع للمتضررين", "فيه مصلحة للمؤسسين والمساهمين");
        db.insertData("Religion", "3", "علام استند موسى عليه السلام بفقد الحوت ؟ ", "مكان العبد الصالح ", "نفاذ الطعام ", "أخذ قسط من الراحة", "مكان العبد الصالح", "لقاء اليتيمين");
        db.insertData("Religion", "3", "أي من الأتي لا يدخل في البدع ؟ ", "السُبحة ", "السُبحة", "عصمة بعض الأشخاص", "نذر الوقوف في الشمس ", "جعل الحجر الأسود على يمين من يطوف");
        db.insertData("Religion", "3", "ما حكم الإجهاض بدون سبب ؟ ", "محرم قبل نفخ الروح وبعده", "مباح قبل نفخ الروح", "حرام بعد نفخ الروح", "محرم قبل نفخ الروح وبعده", "مكروه قبل نفخ الروح");
        db.insertData("Religion", "3", "ما سبب حاجة العالم اليوم إلى قيم الحضارة الإسلامية ؟ ", "إعادة الإنسان إلى مكانته السامية التي خلقه الله عليها", "إيجاد التوازن بين المجتمعات فيما يتعلق بالردع والقوى العسكرية", "ترسيخ القيم السامية التي جاء بها سام بن نوح", "النهوض بالقيم المادية والقضاء على الفقر بالمجتمعات", "إعادة الإنسان إلى مكانته السامية التي خلقه الله عليها");
        db.insertData("Religion", "3", "ما السنن المجتمعية التي يدل عليها قوله تعالى :(ولا يغرنك تقلب الذين كفروا بالبلاد) ؟ ", "التداول والتدافع", "ربط النتائج بالأسباب", "التداول والتدافع", "التغيير والاستبدال", "التمكين للمؤمنين");
        db.insertData("Religion", "3", "ما الغرض الذي يفيده الاستفهام في قوله تعالى :(أفحكم الجاهلية يبغون) ؟ ", "الإنكار والتوبيخ", "النفي", "الاستيضاح", "الإرشاد والتعليم", "الإنكار والتوبيخ");
        db.insertData("Religion", "3", "علام يدل عفو صلاح الدين عن أسرى الصليبيين الذين لا يملكون فدية ؟ ", "تسامحه", "شجاعته", "تقواه", "كرمه", "تسامحه");
        db.insertData("Religion", "3", "ماالذي لا يعد من ضوابط الجهاد في الإسلام ؟ ", "سوء معاملة الأسرى", "تحريم الخيانة والغدر", "تحريم قتل الرهبان", "تحريم التمثيل بالجثث", "سوء معاملة الأسرى");
    }

    //Done
    private void setArabicExam() {
        db.insertData("Arabic", "1", "ما المقصود بالنجم في : إذ رف نجم فخُّدامه   وأحمق أعدله إن هوى ؟ ", "الحاكم", "جرم سماوي", "الشمس", "الحاكم", "الإسبان");
        db.insertData("Arabic", "1", "ما الغرض البلاغي للاستفهام في (وهل تقوى يد آثمة على قدر الله ) كما وردت في القدس بوصلة ومجد ؟ ", "النفي", "النفي", "التعجب", "الإنكار", "التحسر");
        db.insertData("Arabic", "1", "ما معنى العقود -التي هي جمع عقد- في عبارة : أزقتها مقوسة العقود ؟ ", "السقف المقوس", "10 سنوات", "ما تتزين به المرأة", "السقف المقوس", "الاتفاق الموقع بين الطرفين");
        db.insertData("Arabic", "1", "ما المقصود بالمطر في (مطرٌ على الأقصى) ؟ ", "المطر الحقيقي", "المطر الحقيقي", "الرصاص الكثيف", "الدموع الغزيرة", "الدماء المسفوكة");
        db.insertData("Arabic", "1", "أي الأسماء التالية مصروف ؟ ", "البصرة", "مهامٌ", "البصرة", "صحراء", "أحسن");
        db.insertData("Arabic", "1", "أي الكلمات الآتية لم يحدث لها إبدال ؟ ", "اُتبع", "اُتقى", "اُتسم", "اُتبع", "اُتزن");
        db.insertData("Arabic", "1", "أين تكمن خطورة مواقع التواصل الاجتماعي ؟ ", "دورها الاجتماعي", "في أماكن انتشارهاٌ", "في تطورها التقني", "في دورها الاجتماعي", "في تبادل المعارف");
        db.insertData("Arabic", "1", "علام يعود الضمير الهاء في البيت : بالأمس حرّمت الرثاء على فمي واليوم يُتمي فيك أحله؟ ", "الرثاء", "الأمسٌ", "الرثاء", "اليوم", "يُتمي");
        db.insertData("Arabic", "1", "ما البديل المناسب لملء الفراغ في : سرتُ في .... ؟ ", "بيداء مقفرة", "بيداءَ مُقفرةٍ", "بيداءَ مُقفرةٌ", "بيداءِ مقفرةٍ", "بيداء مقفرة");
        db.insertData("Arabic", "1", "ما الذي تمثله مدينة (فوجيساوا) اليابنية الذكية ؟ ", "صديقة البيئة", "مقاومة آثار الزلازل", "تنظيم حركة المرور على الطرقات", "صديقة للبيئة", "تحقيق الجاذبية السياحية");
        db.insertData("Arabic", "2", "من الذي يظل الله بظله يوم القيامة , وفق ما جاء في الحديث الشريف ؟ ", "الإمام العدل", "المرابط في سبيل الله", "طالب العلم", "من لا يخاف في الله لومة لائم", "الإمام العدل");
        db.insertData("Arabic", "2", "ما المقصود ب(السادية) في قول الكاتب : ردّدوها بقليل من العربية , وكثيرٍ من السادية ؟ ", "التلذذ بممارسة العنف", "التلذذ بممارسة العنف", "الظلم والاستبداد", "اللغة العبرية", "السب والشتم");
        db.insertData("Arabic", "2", "ما المقصود بالليل في : (والليل كالشحاذ يطرق بالدموع والأنين) ؟ ", "الهموم وانعدام السكينة", "الهموم وانعدام السكينة", "الاحتلال الغاشم", "اللجوء المرير", "الظلام والعتمة");
        db.insertData("Arabic", "2", "أي من الآتية من أعمال معين بسيسو النثرية ؟ ", "دفاتر فلسطينية", "فلسطين في القلب", "دفاتر فلسطينية", "المعركة", "قمر جنوبي");
        db.insertData("Arabic", "2", "أي من الجمل التالية تضمنت اسم فعل فعل ؟ ", "رويدك لا تخدعك المظاهرًً", "حيّ ضيوفك", "حاذر عدوك", "أمهلهم رويداّ", "رويدك لا تخدعك المظاهر");
        db.insertData("Arabic", "2", "ما معنى المُتفيهق ؟ ", "المتكبر", "الثرثار", "مدعي الفقه والعلم", "المتكبر", "المتطاول على الناس في الكلام");
        db.insertData("Arabic", "2", "من أول من تنبأ بتحوبل العالم إلى قرية صغيرة ؟ ", "مارشال ماكلوهن", "مارك فرنسكي", "مارشال ماكلوهن", "دوستيفسكي", "نابليون بونابارت");
        db.insertData("Arabic", "2", "ما اللون البديعي الوارد في العبارة الأتية (أحال الفرحة غصة) ؟ ", "جناس", "ترادف", "طباق", "جناس", "كناية");
        db.insertData("Arabic", "2", "إلام رمزت البومة في قصة غسان كنفاني ؟ ", "عملاء الاحتلال", "عملاء الاحتلال", "اللجوء والتشرد", "الشؤم والخراب", "التفائل والاستبشار");
        db.insertData("Arabic", "2", "أي من الأتية مجموعة قصصة لغسان كنفاني ؟ ", "موت سريري رقم 12", "أم سعد", "ما تبقى لكم", "موت سرير رقم 12", "عائد إلى حيفا");
        db.insertData("Arabic", "3", "أي من المؤلفات التالية هو ديوان لعزيز أباظة ؟ ", "أنّات حائرة", "شجرة الدر", "غروب الأندلس", "البطولات الإسلامية", "أنّات حائرة");
        db.insertData("Arabic", "3", "ما جذر كلمة يستبيح في قول الشاعر ( يرسو بجفني حرمان يمّص دمي يستبيح ابتساماتي ) ؟ ", "بوح", "بيح", "بوح", "سبح", "سيح");
        db.insertData("Arabic", "3", "أي الأعمال الأدبية الآتية لشاعر أحمد بخيت ؟ ", "شهد العزلة", "رجال في الشمس", "شواطئ القمر", "شهد العزلة", "المعركة");
        db.insertData("Arabic", "3", "ما دلالة العبارة لك يا بن حزن السنديان ؟ ", "الحزن العميق والألم", "الحزن العميق والألم", "الطفل الفلسطيني", "المغترب", "السيف");
        db.insertData("Arabic", "3", "من مسرحيات عبد اللطيف عقل ؟ ", "البلاد طلبت أهلها", "شواطئ القمر", "أغاني القمة والقاع", "البلاد طلبت أهلها", "دفاتر فلسطينية");
        db.insertData("Arabic", "3", "أي من الكلمات الآتية همزتها غير أصلية ؟ ", "بناء", "أجزاء", "ضياء", "بناء", "إنشاء");
        db.insertData("Arabic", "3", "ما الحروف التي يقع فيها الإبدال ؟ ", "بعض أحرف العلة والصحيحة", "بعض أحرف العلة", "الحروف الصحيحة", "جميع أحرف العلة", "بعض أحرف العلة والصحيحة");
        db.insertData("Arabic", "3", "ما الوزن الصرفي لكلمة مكواة ؟ ", "مفعلة", "مفعاة", "مفعلة", "فعللة", "مفعية");
        db.insertData("Arabic", "3", "من مثل شخصة الأمين على مصلحة الأمة في مسرحية غروب الأندلس ؟ ", "ابن سراج", "الوزير أبو القاسم", "ابن سراج", "الحاكم (أبو عبد الله )", "شيخ القضاة");
        db.insertData("Arabic", "3", "أي من الدول العربية الآتية كانت سباقة إلى تخطيط المدن الذكية ؟ ", "الإمارات العربية", "الكويت", "الإمارات العربية", "البحرين", "عُمان");

    }

    //Done
    private void setHistoryExam() {
        db.insertData("History", "1", "أي من الدول التالية شاركت في معركة سولفرينو عام 1859 ؟ ", "فرنسا والنمسا", "فرنسا والنمسا", "روسيا والنمسا", "ألمانيا والنمسا", "فرنسا وإيطاليا");
        db.insertData("History", "1", "من القائد الذي فتحت على يده جزيرة صقلية ؟ ", "موسى بن نصير", "طارق بن زياد", "موسى بن نصير", "عمرو بن العاص", "عبد الرحمن الغافقي");
        db.insertData("History", "1", "ما الدولة التي أعلن من على أرضها وثيقة استقلال فلسطين ؟ ", "الجزائر", "السودان", "تونس", "الجزائر", "العراق");
        db.insertData("History", "1", "ما الاتفاقية التي حصلت بموجبها الجزائر على استقلالها عام 1962 ؟ ", "اتفاقية ايفيان", "اتفاقية ايفيان", "برست ليتوفيسك", "سيفر", "لوزان");
        db.insertData("History", "1", "أي من الدول التالية شكلت دول الوسط في الحرب العالمية الأولى ؟ ", "ألمانيا , الدولة العثمانية , النمسا", "ألمانيا , فرنسا , النمسا", "روسيا, بريطانيا , فرنسا", "ألمانيا ,الدولة العثمانية , النمسا", "ألمانيا , فرنسا , بلجيكا");
        db.insertData("History", "1", "ما الدولة التي بدأ فيها الحراك العربي ؟ ", "تونس", "اليمن", "مصر", "تونس", "السودان");
        db.insertData("History", "1", "ما اسم الصلح الذي أنهي الحملة الفرنجية الثالثة ؟ ", "الرملة", "يافا", "القدس", "صور", "الرملة");
        db.insertData("History", "1", "في أي عام احتل الفرنجية مدينة القدس ؟ ", "1099 م", "1087 م", "1092 م", "  1099 م", "1201 م");
        db.insertData("History", "1", "ما السلاح الذي أستخدم لأول مرة في حرب السوم عام 1916 م ؟ ", "الدبابات", "المدفيعة", "الصواريخ", "الغواصات", "الدبابات");
        db.insertData("History", "1", "أي من الآتية تعد من الثورات المسلحة ؟ ", "الثورة الصينية", "ثورة جنوب إفريقيا", "الثورة الصينية", "الثورة المجيدة في بريطانيا", "ثورة الياسمين في تونس");
        db.insertData("History", "2", "ما السبب المباشر من اندلاع الحرب العالمية الأولى ؟ ", "اغتيال ولي عهد النمسا", "خلاف الصرب والنمسا على البلقان", "التحالفات الدولية", "اغتيال ولي عهد النمسا", "الخلاف على ميناء دانزج");
        db.insertData("History", "2", "في أي ميدان حدثت الاعتصامات المليونية في مصر ؟ ", "التحرر", "الجوهرة", "التحرر", "اللؤلؤة", "النصر");
        db.insertData("History", "2", "ما الهدف من تأسيس روابط القرى في مرحله الثمانينيات ؟ ", "إضعاف منظمة التحرير الفلسطينية", "إضعاف منظمة التحرير الفلسطينية", "توفير خدمات للمواطنين", "عرقلة المسيرة النضالية", "تحسين الظروف المعيشية");
        db.insertData("History", "2", "ما سبب دخول الولايات المتحدة الحرب العالمية الثانية ؟ ", "قصف اليابان  لقاعدة بيرال هاربر الأمريكية", "احتلال ألمانيا العاصمة الفرنسية", "انتصار الحلفاء في معركة العلميين", "طردألمانيا من بلجيكا وجنوب بولندا", "قصف اليابان  لقاعدة بيرال هاربر الأمريكية");
        db.insertData("History", "2", "ما سبب المباشر من لاندلاع الفلسطينية عام 1987 م ؟ ", "حادثة دهس العمال الفلسطينيين", "استشهاد عدد من طلبة جامعة بيرزيت", "حادثة دهس العمال الفلسطينيين", "ابعاد القيادات الفلسطينية", "مجزرة الحرم الإبراهيمي");
        db.insertData("History", "2", "ما المقصود بالحركة التصحيحية ؟ ", "انقلاب عسكري من أعلى هرم السلطة", "ثورة لا يسقط فيها ضحايا", "انقلاب عسكري من أعلى هرم السلطة", "انتفاضة شعبية", "ثورة طويلة الأمد");
        db.insertData("History", "2", "بماذا تسمى حالة الصراع بين الطرفين التي تستخدم فيها الكثير من الوسائل دون الصدام المسلح ؟ ", "حرب باردة", "حري الاستنزاف", "حرب العصابات", "حرب أهلية", "حرب باردة");
        db.insertData("History", "2", "كيف يكون الدعم الخارجي أحد عوامل فشل الثورات ؟ ", "إذا ارتبطت قرارات الثورة بالداعمين", "إذا ارتبطت قرارات الثورة بالداعمين", "إذا كانت الثورة تصب في جانب القوات الحكومية", "إذا اعتمدت الأسلوب السلمي", "إذا تناسب الدعم مع حجم المشاركة الشعبية");
        db.insertData("History", "2", "ما سبب خسارة المسليمن في معركة الجسر 13 هجري - 634 م ؟ ", "اعتماد الفرس على الفيلة والسهام", "استخدام الفرس أعداد كبيرة من المقاتلين", "اعتماد الفرس على الفيلة والسهام", "التحالف بين الفرس والبيزنطينين", "عزل خالد بن الوليد عن قيادة الجيش");
        db.insertData("History", "2", "ما القوى الخارجية التي أسهمت في اندلاع الحراك العربي ؟ ", "حلف شمال الأطلسي والاحتلال الصهيوني والولايات المتحدة", "حلف شمال الأطلسي والاحتلال الصهيوني والولايات المتحدة", "حلف وارسو والاحتلال الصهيوني والولايات المتحدة", "حلف وارسو وحلف شمال الأطلسي والاحتلال الصهيوني", "روسيا وحلف شمال الأطلسي والولايات المتحدة");
        db.insertData("History", "3", "ما المبرر الذي اعتمدته الإمبراطورية لتخلص البشر من الشرور ؟ ", "الديني", "الديني", "الحضاري", "السياسي", "الاقتصادي");
        db.insertData("History", "3", "متى فتح السلطان محمد الفاتح القسطنطينية ؟ ", "1453 م ", "1187 م ", "1453 م", "1435 م", "1543 م");
        db.insertData("History", "3", "ما اسم المعركة التي على أثرها سيطر العثمانيون على مصر ؟ ", "الريدانية", "مرج دابق", "الريدانية", "جالديران", "مراكش");
        db.insertData("History", "3", "من هو السلطان العثماني الذي بدأ في عهده التوسع العثماني شرقاً ؟ ", "سليم الأول", "محمد الفاتح ", "عثمان", "عبد الحميد", "سليم الأول");
        db.insertData("History", "3", "ما الأسلوب الذي استخدمته بريطانيا في التوسع البريطاني في إفريقيا ؟ ", "تجارة الرقيق", "الشركات التجارية ", "البحث عن النفط", "تجارة الرقيق", "المعاهدات");
        db.insertData("History", "3", "ما اسم كنيسة المذهب الديني المسيحي الذي تذرعت به بريطانيا للتوسع الاستعماري ؟ ", "البروتيستانتي", "الكاثوليكي ", "الارثوذكسي", "الغربي", "البروتيستانتي");
        db.insertData("History", "3", "ما النظام الدولي الذي ساد العالم بعد حرب الخليج الثاني ؟ ", "احادي القطبية", "احادي القطبية ", "ثنائي القطبية", "متعدد الأقطاب", "اشتراكي");
        db.insertData("History", "3", "ماذا تسمى الحرب التي تدور بين أبناء الشعب الواحد ؟ ", "أهلية", "الاستنزاف", "العصابات", "أهلية", "باردة");
        db.insertData("History", "3", " من هي أخر دولة استسلمت في الحرب العالمية الأولى عام 1918 م ؟ ", "ألمانيا", "ألمانيا ", "الدولة العثمانية", "روسيا", "النمسا");
        db.insertData("History", "3", "من قائد قوات المحور في معركة العلميين ؟ ", "رومل", "هتلر", "رومل", "موسوليني", "مونتجمري");
    }

    private void setGeographyExam() {
        db.insertData("Geography", "1", "أي المناطق الأتية غنية بالبترول والغاز الطبيعي ؟ ", "منطقة الخليج العربي", "غرب أوروبا", "منطقة الخليج العربي", "شرق آسيا", "شمال أوروبا");
        db.insertData("Geography", "1", "أي المناطق الجغرافية الآتية التي يظهر فيها مناخ التندرا ؟ ", "شمال إيسلندا", "شمال إيسلندا", "وسط سيبيريا", "الالاسكا", "شمال كندا");
        db.insertData("Geography", "1", "ما الأسس التي يعتمد عليها التصنيف المكاني للموارد الطبيعية ؟ ", "طبيعة الانتشار", "طبيعة الانتشار", "مدى استهلاكها", "نشأتها وتركيبها", "حالتها في الطبيعة");
        db.insertData("Geography", "1", "ضمن أي تصنيف تدخل الموارد الطبيعية الآتية ( المد والجزر والرياح ) ؟ ", "دائمة", "واسعة الانتشار", "نادرة الوجود", "دائمة", "عضوية وغير عضوية");
        db.insertData("Geography", "1", "كيف يسهم التقدم العلمي والتكنلوجي في تخفيف الاستغلال المفرط لكثير من الموارد الطبيعية ؟ ", "ايجاد بدائل لها", "زيادة أسعارها", "ايجاد بدائل لها", "تقليل استغلالها", "خفض أسعارها");
        db.insertData("Geography", "1", "كم يتراوح معدل كمية الأمطار السنوية في إقليم مناخ البحر المتوسط ؟ ", "600/400 ملم", "300/400 ملم", "600/400 ملم", "900/100 ملم", "أكثر من 1500 ملم");
        db.insertData("Geography", "1", "ما السياسة التي تعبر عن تثبيت سعر محصول أو منيج عند هبوط سعره وتدعمه الحكومة أو تشتريه وتصرفه للأسواق ؟ ", "تعزيز الأسعار", "تشجيع الاستيراد", "تعزيز الاحتكار", "التقشف", "تعزيز الأسعار");
        db.insertData("Geography", "1", "متى حدثت كارثة انفجار مفاعل تشيرنوبيل في أوكرانيا ؟ ", "1986 م", "1986 م", "1996 م", "1968 م", "1989 م");
        db.insertData("Geography", "1", "في أي محيط حدث تسونامي عام 2004 م ؟ ", "الهندي", "الأطلسي", "الهادئ", "الهندي", "المتجمد الشمالي");
        db.insertData("Geography", "1", "ما التجويف الأسطواني الشكل من البركان الذي يصل بين الفوهة والمواد المنصهرة (الماغما) ؟ ", "القصبة", "الفوهة", "القصبة", "العروق البركانية", "قاعدة البركان");
        db.insertData("Geography", "2", "أي من الأجهزة الآتية يستخدم لرصد الزلازل ؟ ", "السيزموغراف", "الباروميتر", "الهيجرميتر", "السيزموغراف", "ريختر");
        db.insertData("Geography", "2", "إذا علمت أن الضفط الجوي = 1013 ميلي بار عند مستوى سطح البحر فكم يصبح عند ارتفاع 100 متر فوق مستوى سطح البجر ؟ ", "1003 ميلي بار", "993 ميلي بار", "1003 ميلي بار", "1023 ميلي بار", "1033 ميلي بار");
        db.insertData("Geography", "2", "ما سبب تعرض المحطات الكهربائية التي تعمل للفحم الحجري للانتقاد ؟ ", "أضرارها على البيئة", "أضرارها على البيئة", "حاجتها لتقنيات عالية", "الحيز الكبير الذي تشغله", "تكلفتها المرتفعة");
        db.insertData("Geography", "2", "متى برزت أهمية اليورانيوم كمصدر لطاقة النووية ؟ ", "1945 م", "1917 م", "1935 م", "1945 م", "1955 م");
        db.insertData("Geography", "2", "ما الهدف من اتفاقية كيوتو عام 1997 م ؟ ", "مكافحة الاحتباس الحراري", "تسهيل التجارة العالمية", "مكافحة الفقر", "مكافحة الجريمة", "مكافحة الاحتباس الحراري");
        db.insertData("Geography", "2", "أي من الآتية لا يعد من خصائص الغابات المخروطية ؟ ", "النفضية", "جذوعها مستقيمة", "مخروطية الشكل", "أوراقها إبرية", "النفضية");
        db.insertData("Geography", "2", "أين توجد أحراج وادي قنا ؟ ", "سلفيت", "جنين", "سلفيت", "طولكرم", "نابلس");
        db.insertData("Geography", "2", "ما اتجاه حركة الرياح القطبية في نصف الكرة الأرضية الشمالي ؟ ", "شمالي شرقي", "جنوبي غربي", "شمالي شرقي", "شمالي غربي", "جنوبي شرقي");
        db.insertData("Geography", "2", "ما التيار المائي الذي يعمل على رفع درجة حرارة السواحل الشرقية لقارة آسيا ؟ ", "اليابان", "الخليج", "بنجويلا", "كناري", "اليابان");
        db.insertData("Geography", "2", "أي المناطق الآتية تتآثر برياح الخماسيني ؟ ", "مصر وبلاد الشام", "جنوب شرق آسيا", "جنوب أوروبا", "مصر وبلاد الشام", "دول الخليج العربي");
        db.insertData("Geography", "3", "بما تفسر : يتلقى غرب أوروبا ووسطها كمية قليلة من الإشعاع الشمسي ؟ ", "وجود الغبار والغيوم", "صفاء الجو", "كثافة الغطاء النباتي", "وجود الغبار والغيوم", "ارتفاع درجة الحرارة");
        db.insertData("Geography", "3", "واحدة من الآتية ليست من طرق انتقال الحرارة في الغلاف الجوي ؟ ", "الإشعاع الشمسي المباشر", "الإشعاع الشمسي المباشر", "التلامس والحمل الحراري", "فقدان الحرارة الكامنة في بخار الماء", "التسخين الذاتي للهواء");
        db.insertData("Geography", "3", "ما اسم نطاق الضغط الجوي الممتد بين درجتي عرض 25 - 60 شمال وجنوب خط الاستواء ؟ ", "المنخفض شبه القطبي", "المنخفض الاستوائي", "المنخفض شبه القطبي", "المرتفع المداري", "المرتفع القطبي");
        db.insertData("Geography", "3", "بما تفسر انخفاض الضغط الجوي في المناطق الساحلية ؟ ", "ارتفاع نسبة الرطوبة", "ارتفاع نسبة الرطوبة", "انخفاض نسبة الرطوبة", "تأثير نسيم البر", "تأثير نسيم البحر");
        db.insertData("Geography", "3", "ما نوع الرياح التي تهب على جنوب شرق آسيا ؟ ", "موسمية", "محلية", "يومية", "قطبية", "موسمية");
        db.insertData("Geography", "3", "بما تفسر وجود بعض المعادن في مناطق بعيدة عن مناطق تكونها الأصلي ؟ ", "عوامل التعرية", "التركيب الجيولوجي", "عوامل التعرية", "الظروف المناخية", "الصدع والانكسار");
        db.insertData("Geography", "3", "ماذا نطلق على الشرارة الكهربائية الناجمة عن التفريغ الكهربائي بفعل تماس بين الشحنات الكهربائية السالبة والموجبة داخل السحب ؟ ", "البرق", "البرق", "الرعد", "الساعقة", "الجبهة الهوائية");
        db.insertData("Geography", "3", "أي من الآتية ليست من خصائص المنخفض الجوي ؟ ", "حدوث استقرار جوي", "ارتفاع قيم الضغط الجوي في الأطراف", "انخفاض قيم الضغط الجوي في المركز", "اندفاع الرياح من الأطراف نحو المركز ", "حدوث استقرار جوي");
        db.insertData("Geography", "3", "كم يبلغ أقل معدل لدرجة الحرارة في الأقاليم الحارة طوال العام ؟ ", "18 درجة مئوية", "18 درجة مئوية", "10 درجة مئوية", "15 درجة مئوية", "22 درجة مئوية");
        db.insertData("Geography", "3", "ما سبب انخفاض المدى الحراري السنوي للإقليم الاستوائي بحيث لا يتجاوز 5 درجة مئوية ؟ ", "تساوي ساعات الليل والنهار", "تساوي ساعات الليل والنهار", "طول ساعات النهار", "كثافة الغيوم", "صفاء الجو");
    }

    //Done
    private void setBiologyExam() {
        db.insertData("Biology", "1", "ما طول الموجات التي يمتص فيها كلوروفيل (a) الضوء بكفاءة عالية ؟ ", "700-400", "600-480", "700-400", "640-460", "600-500");
        db.insertData("Biology", "1", "إذا تم استهلاك 72 جزءاً من حمض جليسارين أحادي الفوسفات في حلقة كالفن , فما عدد جزيئات الجلوكوز التي سيتم إنجازها ؟ ", "6", "4", "6", "8", "12");
        db.insertData("Biology", "1", "إذا نتج 36 جزئ من الماء في عملية التنفس الخلوي , فما عدد جزيئات غلوكوز المتحللة ؟ ", "6", "2", "4", "6", "8");
        db.insertData("Biology", "1", "إذا كان عدد جزيئات ATP الناتجة عن المسار اللاحلقي الإلكتروني من تفاعلات الضوئية = 24 جزئ , فما عدد H+ الناتجة ؟ ", "48", "48", "24", "36", "12");
        db.insertData("Biology", "1", "خلا عملية التنفس إذا أنتجت خلية خميرة 10 جزيئات CO2 فإن عدد جزيئات ATP الناتجة هو ؟ ", "10", "5", "8", "10", "20");
        db.insertData("Biology", "1", "ما مصدر الأكسجين الناتج من عملية البناء الضوئي ؟ ", "H2O", "الهواء", "C6H12O6", "H2O", "CO2");
        db.insertData("Biology", "1", "أي المركبات الآتية يتحد معها جزئ أستيل مرافق أنيم (أ) عند دخوله حلقة كربي  ؟ ", "أوكسالواستيت", "أوكسالواستيت", "الستريت", "حمض غلسرين أحادي الفوسفات", "رايبولوز ثنائي الفوسفات");
        db.insertData("Biology", "1", "ما عدد جزيئات G3P الناتجة في نهاية مرحلة الاختزال عند تثبيت 30 جزئ O2 ؟ ", "60", "10", "60", "90", "120");
        db.insertData("Biology", "1", "ما المركب الذي يختزله NADPH  في حلقة كالفن ؟ ", "حمض جلسرين ثنائي الفوسفات", "حمض جلسرين ثنائي الفوسفات", "جلسرألدهايد أحادي الفوسفات", "حمض غلسرين أحادي الفوسفات", "رايبولوز ثنائي الفوسفات");
        db.insertData("Biology", "1", "في أي الآتية صحيح لاكمال المعادلة NADP + _____ + ______ ->(أنزيم مختزل)  NADPH + H  ؟ ", "2e- , 2H+", "2e- , H+", "H+ , e-", "2H+ , e-", "2e- , 2H+");
        db.insertData("Biology", "2", "أي الثلاثيات الآتية لا يمكن أن توجد في الحلقة الثانية من جزئ tRNA ؟ ", "AUU", "CGA", "UAG", "AUU", "AGU");
        db.insertData("Biology", "2", "بماذا يتم فصل جزيئات الماء في ثيلاكويد النظام الضوئي الثاني في التفاعلات الضوئبة ؟ ", "إنزيم خاص", "مستقبل بروتين", "بروتين ناقل", "بروتين خاص", "إنزيم خاص");
        db.insertData("Biology", "2", "أي العمليات الآتية تهدف إلى مساعدة mRNA للخروج من الغلاف النووي إلى سيتوسول ؟ ", "إضافة الذيل الأدنين", "إزالة الأنترونات", "إضافة الذيل الأدنين", "الالتفاف", "إضافة القبعة");
        db.insertData("Biology", "2", "أي الآتية يعد مستقبل الالكترونات الأخير في التخمر اللبني ؟ ", "البيروفيت", "أسيتالدهايد", "حمض اللبن", "البيروفيت", "الايثالول");
        db.insertData("Biology", "2", "ما عدد السعرات الحرارية لكوب حليب كتلته 300 غم ويحتوي على 5% كربوهيدرات و 3%  دهون و 4% بروتين ؟ ", "189 سعر حراري", "36 سعر حراري", "185 سعر حراري", "189 سعر حراري", "72 سعر حراري");
        db.insertData("Biology", "2", "في أي موقع في الرايبوسومات تتكون الرابطة الببتيدية أثناء بناء البروتين ؟ ", "A", "A", "P", "E", "B");
        db.insertData("Biology", "2", "متى يشكل المحفز مكاناً لارتباط انزيم بلمرة RNA ؟ ", "بدأ النسخ", "بدأ الترجمة", "بدأ النسخ", "إنهاء الترجمة", "أنهاء النسخ");
        db.insertData("Biology", "2", "ما نسبة ظهور دجاج أسود الريش من تزاوج ديك أسود الريش مع دجاجة بيضاء الريش ؟ ", "0%", "0%", "25%", "50%", "75%");
        db.insertData("Biology", "2", "ما كمية الطاقة التي سيحصل عليها أحمد إذا تناول وجبة مكونة من 20 غم ليبيدات و 60 غم بروتينات و 40 غم من الكيبوهيدرات ؟ ", "580", "2300", "720", "580", "950");
        db.insertData("Biology", "2", " إلى ماذا تشير النسبة 1:2:1 في النسل الناتج ؟ ", "السيادة المشتركة", "الجيدات القاتلة", "السيادة التامة", "السيادة المشتركة", "ارتباط الجينات");
        db.insertData("Biology", "3", " أي من الآتية يمثل ناتجاً عن كل من حلقة كربس والمسار لاحلقي للالكترونات ؟ ", "ATP", "ATP", "FADH2", "H2O", "ADB");
        db.insertData("Biology", "3", " أي الطرق التالية تستخدم لفصل DNA بهدف دراستها ؟ ", "الهجرة الكهربية", "العلاج الجيني", "إنزيم اللصق", "الهجرة الكهربية", "الطرد المركزي");
        db.insertData("Biology", "3", "ما التركيب الكروموسومي لذكر مصاب بتلازمة ادورد ؟ ", "XY+45", "XXY+44", "XY+45", "XY+44", "XY+33");
        db.insertData("Biology", "3", " كم عدد الكروموسومات الجسمية في الخلايا الجسمية لفتاة مصابة بتلازمة تيرتر ؟ ", "44", "47", "46", "45", "44");
        db.insertData("Biology", "3", " أي من الصفات الآتية في الانسان تتبع في توريثها الصفات النوعية ؟ ", "القدرة على ثني اللسان", "لون الجلد", "طول القامة", "لون الشعر", "القدرة على ثني اللسان");
        db.insertData("Biology", "3", " أي الاختلالات الوراثية الآتية ناتجة عن طفرة في عدد الكروموسومات ؟ ", "متلازمة كلينفلتر", "عسر النمو العضلي", "مرض كيرابي", "متلازمة كلينفلتر", "حمى البحر الأبيض المتوسط");
        db.insertData("Biology", "3", " أي الطرز الجينية الآتية تؤدي فيه عملية العبور إلى تكون تراكيب جينية جديدة ؟ ", "AaBb", "AaBB", "AaBb", "Aabb", "AABb");
        db.insertData("Biology", "3", " على أي من الآتية تؤثر مادة DNP والتي تعطى للمرضى الذين يعانون من بدانة مفرطة ؟ ", "تدفق البروتينات", "تحلل جزيئات الماء", "تدفق البروتينات", "NADH", "DNA");
        db.insertData("Biology", "3", " أي من العبارات الآتية صحيحة بالننسبة لعملية التخمر ؟ ", "تبدأ بالتحلل الغلايكولي", "ينتج عنها ATP4 كناتج نهائي ", "تنتج NADH الالكترونات لسلاسل النقل الالكترون", "تبدأ بالتحلل الغلايكولي", "تبدأ في السيتويول وتنتهي في حشوة المايتاكوندريا");
        db.insertData("Biology", "3", " أي من الآتية تمثل سبباً لإصابة الشخص بمرض التفول ؟ ", "نقص إنتاج إنزيم أدينوسين دي أميليز", "نقص إنتاج إنزم فنيل الانين هيدروكسليز ", "نقص إنتاج بروتين ديستروفين", "نقص إنتاج إنزيم أدينوسين دي أميليز", "نقص إنتاج إنزيم نازع هيدروجين الغلوكوز");


    }

    //Done
    private void setChemistryExam() {
        db.insertData("Chemistry", "1", "في الطيف الذري اللهبي للعناصر ما لون لهب ملح نترات البوتاسيوم ؟ ", "بنفسجي", "أصفر ", "برتقالي", "أزرق مخضر", "بنفسجي");
        db.insertData("Chemistry", "1", "أي الجمل الآتية غير صحيحة فيما يتعلق بنظرية بور للذرة ؟ ", "تختلف سعة المدارات المتناظرة من ذرة لأخرى", "تختلف طاقة المدارات في الذرة الواحدة", "تختلف طاقة المدارات المتناظرة من ذرة لأخرى ", "تختلف سعة المدارات المتناظرة من ذرة لأخرى", "تختلف سعة المدارات في الذرة الواحدة");
        db.insertData("Chemistry", "1", "ما هو عدد الكم الذي يحدد طاقة وشكل المستوى الفرعي ؟ ", "عدد الكم الفرعي Ɩ", "عدد الكم الرئيسي n", "عدد الكم الفرعي Ɩ ", "عدد الكم المغناطيسي mƖ", "عدد الكم المغزلي");
        db.insertData("Chemistry", "1", " بماذا تختلف الإلكترونات الموجودة في الغلاف الرئيس ( K ) ؟ ", "ms", "n", "Ɩ", " mƖ ", "ms");
        db.insertData("Chemistry", "1", "ما المبدأ الذي ينص على أن الالكترون جسيم مادي وبسبب حركته يمتلك خواص موجية ويستطيع إشعاع أمواج ذات أطوال موجية وترددات وطاقة محددة ؟ ", "مبدأ دي برولي", "مبدأ أينشتاين ", "مبدأ بلانك", "مبدأ دي برولي", "مبدأ شرودنجر");
        db.insertData("Chemistry", "1", "أي العبارات الآتية صحيحة فيما يتعلق بالفلك ( s ) ؟ ", "يزداد حجمه بزيادة رقم الكم الرئيس ", "يتغير شكله بتغير رقم الكم الرئيس", "يزداد حجمه بزيادة رقم الكم الرئيس ", " الرقم الكمي الفرعي ( Ɩ ) له يساوي 1 ", "يزداد عدد إلكتروناته كلما ابتعدنا عن النواه");
        db.insertData("Chemistry", "1", "ما العدد الذري لعنصر يقع في دورة العنصر 19K  ومجموعة العنصر 2He ؟ ", "36", "20", "21", "30", "36");
        db.insertData("Chemistry", "1", "ما العنصر الأقوى كعامل مؤكسد من بين العناصر الآتية ؟ ", "CL17", "CL17", "Mg12", "C6", "P15");
        db.insertData("Chemistry", "1", "أي الآتية الأعلى طاقة تأين ؟ ", "طاقة التأين الثاني للبوتاسيوم K19", "طاقة التأين الأول للبوتاسيوم K19", "طاقة التأين الأول للكالسيوم Ca20", "طاقة التأين الثاني للبوتاسيوم K19", "طاقة التأين الثاني للكالسيوم Ca20");
        db.insertData("Chemistry", "1", "إذا كانت الزاوية بين الروابط في جزيء كبريتيد الهيدروجين H2S تساوي 91 º  فما الأفلاك المتداخلة في تكوين الرابطة (S ̶ H ) علما ً بأن العدد الذري (H = 1 ،  S = 16) ؟ ", "  1s–3p ", " px –  px", "1s  –sp3", "1s – sp2", "  1s–3p ");
        db.insertData("Chemistry", "2", "جزيء YX2 يحتوي رابطتين σ وواحدة π وزوج الكترونات غير رابط على الذرة المركزية ما شكل الجزيء المتوقع لهذا المركب ؟ ", "منحنٍ زاوي ", "منحنٍ زاوي ", "هرم ثلاثي", "مثلث مستو", "خطي مستقيم ");
        db.insertData("Chemistry", "2", "أي الأفلاك المتداخلة الآتية المشاركة في تكوين رابطة σ بين ذرتي الكربون ( 2 و 3 ) في جزيء 1- بروباين  1   2     3  CH3C≡CH علما ً بأن العدد الذري ( C = 6 ,  H = 1)  ؟ ", "sp – sp3", " sp – sp", "sp – sp3", "p – sp2", "sp2 – sp2");
        db.insertData("Chemistry", "2", "أي الروابط الأعلى طاقة فيما يلي ( 1H ، 7N , 8O ، 9F ، 17Cl ) ؟ ", "H ̶ F", "H ̶ N", "H ̶  O", "H ̶ F", "H ̶  Cl");
        db.insertData("Chemistry", "2", "أي العمليات الآتية غير تلقائية ؟ ", "انصهار الجليد عند  ¯ 10º س ", "انشار الحبر في الماء  ", "صدأ قطعة من الحديد ", "تبخر السوائل من كأس مفتوح", "انصهار الجليد عند  ¯ 10º س ");
        db.insertData("Chemistry", "2", "أي العبارات الآتية صحيحة فيما يخص التفاعل الآتي  2NH3 (g)  ∆Hº =  ̶   92 KJ   + 3H2(g)   N2(g) ؟ ", "تلقائي عند درجات الحرارة المنخفضة وغير تلقائي عند درجات الحرارة المرتفعة .", "غير تلقائي عند جميع درجات الحرارة .", "تلقائي عند جميع درجات الحرارة .", "تلقائي عند درجات الحرارة المنخفضة وغير تلقائي عند درجات الحرارة المرتفعة .", "تلقائي عند درجات الحرارة المرتفعة وغير تلقائي عند درجات الحرارة المنخفضة .");
        db.insertData("Chemistry", "2", "عندما تكون قيمة ∆H ) > صفر )  لتفاعلٍ ما ، كيف يكون هذا التفاعل تلقائي ؟ ", "∆H ˃ ∆Sº.T ", "∆H ˃ ∆Sº.T ", "∆H > ∆Sº.T", "∆H = ∆Sº.T", "∆G > صفر");
        db.insertData("Chemistry", "2", "ماذا يطلق على الصيغة الرياضية    ∆S Univ > صفر ( موجب دائماً ) ؟ ", " القانون الثاني للديناميكا الحرارية", "طاقة جبس الحرة ", "المحتوى الحراري", "القانون الأول للديناميكا الحرارية ", " القانون الثاني للديناميكا الحرارية");
        db.insertData("Chemistry", "2", " التفاعل الافتراضي الآتي من الرتبة الأولى :  ( A(g) B(g) ) إذا كان تركيز المادة A الابتدائي  مول/لتر وبعد 14 دقيقة أصبح تركيز المادة B = 0.025 مول /لتر ، ما مقدار عمر النصف لتفكك المادة A ؟ ", "189.4 دقيقة", "189.4 دقيقة", "3.24 دقيقة", "3.24 ثانية ", " 189.4 ثانية");
        db.insertData("Chemistry", "2", "أي العبارات الآتية غير صحيحة عندما يتم رفع درجة حرارة التفاعل ؟ ", "تزداد طاقة التنشيط  ", "تزداد قيمة k ", "تزداد طاقة التنشيط  ", " تزداد عدد التصادمات الفعالة ", "لا تتغير رتبة التفاعل");
        db.insertData("Chemistry", "2", "أي المستويات الفر عية الآتية له أقل طاقة في نفس الذرة ؟ ", "4d", "6p", "4d", "4f", "6s");
        db.insertData("Chemistry", "3", "أي المحاليل الآتية المتساوية في التركيز له أعلى قيمة pH ؟ ", "NaF", "NaCl", "NH4Cl", "NaF", "HCL");
        db.insertData("Chemistry", "3", "أي من الأزواج الآتية يصلح كمحلول منظم ؟ ", "HCN/KCN", "HCN/KCN", "HCl/KOH", "HNO3/KNO3", "H2O/OH-");
        db.insertData("Chemistry", "3", "ما قيمة pH لمحلول (0.5) مول/لتر 2(Ba(OH علماً أنه يتفكك كلياً في الماء ؟ ", "13", "1", "1.3", "12.7", "13");
        db.insertData("Chemistry", "3", "ماالذي يتنج من تفاعل الأميد الأولي مع الماء بوجود حمض الكبريتيك ؟ ", "حمض كربوكسيلي", "أمين أولي", "أمين ثانوي", "أمين ثالثي", "حمض كربوكسيلي");
        db.insertData("Chemistry", "3", "ما الذي يتنج من تمرير بخار المركب (بروبانول -2) على مسحوق نحاس عند درجو حرارة 300 س ؟ ", "بروبانون", "بروبانال", "حمض بروبانويك", "بروبانون", "بروبانوات النحاس");
        db.insertData("Chemistry", "3", "ما نوع المركب العضوي CH3NHCH3 ؟ ", "أمين", "أميد", "أمين", "كيتون", "استر");
        db.insertData("Chemistry", "3", "ما الناتج العضوي من تفاعل (-1 برومو بروبان) مع هيدروكسيد الصوديومفي وسط كحولي مع التسخين ؟ ", "بروبين", "-1 بروبانال", "-2 بروبانال", "بروبين", "بروبانال");
        db.insertData("Chemistry", "3", "أي العبارات الآتية صحيحة فيما يتعلق بالخلية الجلفانية ؟ ", "إشارة المصعد سالبة", "إشارة جهد الخلية الجلفانية سالبة", "يحدث التأكسد على المهبط", "التفاعل الكيميائي فيها غير تلقائي", "إشارة المصعد سالبة");
        db.insertData("Chemistry", "3", "إذا كان ثابت السرعة لتفاعل المادة A يساوي 0.005 مول / لتر.ث وتركيز المادة A الابتدائي يساوي 0.1 مول / لتر , ما تركيز المادة A (مول/لتر) بعد 4 ثوان ؟ ", "0.080", "0.020", "0.080", "0.091", "0.095");
        db.insertData("Chemistry", "3", "إذا كان عمر النصف لتفاعل من الرتبة الأولى 0.5 ث , فما قيمة k لهذا التفاعل ؟ ", "1.386", "0.3465", "0.7215", "0.693", "1.386");


    }

    //Done
    private void setData() {
        deleteAllData();
        setReligionExam();
        setArabicExam();
        setHistoryExam();
        setGeographyExam();
        setBiologyExam();
        setChemistryExam();
    }

    //Done
    private ArrayList<Exam> getData(String exam_name, String exam_part) {
        ArrayList<Exam> Question = new ArrayList<Exam>();
        Cursor cursor = db.getAllData();
        while (cursor.moveToNext()) {
            if (exam_name.equals(cursor.getString(1)) && exam_part.equals(cursor.getString(2)))
                Question.add(new Exam(exam_name, cursor.getString(3)
                        , cursor.getString(4)
                        , new ArrayList<String>(Arrays.<String>asList(
                        cursor.getString(5),
                        cursor.getString(6),
                        cursor.getString(7),
                        cursor.getString(8)
                ))));
        }
        return Question;
    }

    private void getQuestions() {
        for (int i = 0; i < 10; i++)
            Questions[i] = exam.get(i).getQuestion();
    }

    private void deleteAllData() {

        db.deleteData();
    }

    private ArrayList<Exam> getRandomQuestions() {
        ArrayList<Exam> randomQuestions = new ArrayList<Exam>();
        int[] numbers = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
        int index;
        getQuestions();

        for (int i = 0; i < 10; i++) {
            Log.d("ahmadtrue", i + "");
            index = (int) (Math.random() * exam.size());
            if (numbers[index] == 0) {
                randomQuestions.add(exam.get(index));
                numbers[index] = 1;
                Log.d("index_", index + "");
            } else
                i--;
        }

        return randomQuestions;
    }

    @Override
    public void onBackPressed() {

    }


}
